**1. Classification avec KNN**

**2. Classification des données réelles (tabulaires)**

**2.1. Charger les données employes2.csv à partir de Google Drive**

In [162]:
df_employees = pd.read_csv('employes2.csv',index_col=0)

In [163]:
df_ = df_employees.copy
df_employees

          salaire    prime   etat civil date recrutement  classe
nom
Ali      1200.675  100.560  celibataire       20/10/2018  junior
Sonia    2800.786  400.876        marie       30/11/2005  senior
Rahma         NaN  130.987  celibataire       04/02/2017  junior
Salma    2500.876  340.600        marie       03/02/2010  senior
Ahmed    3100.760      NaN        marie       09/09/2004  senior
Saleh    1300.876  150.900  celibataire       01/01/2017  junior
Ameni    1100.660  130.870  celibataire       11/05/2019  junior
Mehdi    3000.760      NaN        marie       07/07/2000  senior
Salem    1505.760  159.700  celibataire       21/11/2017  junior
Sameh    2700.330  400.000        marie       19/02/1999  senior
Wajdi    1200.980      NaN  celibataire       27/11/2015  junior
Moufida  3700.440  500.000        marie       09/12/1991  senior

**2.2. Division des données en entrée et sortie**

Données d'entrée X

C'est la partie de dataframe composée de toutes les colonnes sauf la dernière colonne 'classe'

In [164]:
X = df_employees.iloc[:,:-1]
Y = df_employees.iloc[:,-1]

Données de sortie y

C'est la dernière colonne 'classe' de df_employes

In [165]:
#

**2.3. Division des données en train**

Les données sont divisées en train (60%) et test (40%)

Diviser X en X_train et X_test

Diviser y en y_train et y_test

Note : 
- Utiliser la fonction train_test_split() du module sklearn.model_selection
- Précisier le paramètre train_size = 60% des données
- Précisier le paramètre stratify  qui prend y. Il permet de garantir la même répartition entre train et test (en terme des échantillons/classe)

In [166]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split(X,Y,train_size=0.4,random_state=0,shuffle=True)
print(X_train)
print(X_test)
print(Y_train)
print(Y_test)

        salaire   prime   etat civil date recrutement
nom
Sameh  2700.330  400.00        marie       19/02/1999
Salma  2500.876  340.60        marie       03/02/2010
Ali    1200.675  100.56  celibataire       20/10/2018
Saleh  1300.876  150.90  celibataire       01/01/2017
          salaire    prime   etat civil date recrutement
nom
Ameni    1100.660  130.870  celibataire       11/05/2019
Moufida  3700.440  500.000        marie       09/12/1991
Ahmed    3100.760      NaN        marie       09/09/2004
Wajdi    1200.980      NaN  celibataire       27/11/2015
Rahma         NaN  130.987  celibataire       04/02/2017
Salem    1505.760  159.700  celibataire       21/11/2017
Sonia    2800.786  400.876        marie       30/11/2005
Mehdi    3000.760      NaN        marie       07/07/2000
nom
Sameh    senior
Salma    senior
Ali      junior
Saleh    junior
Name: classe, dtype: object
nom
Ameni      junior
Moufida    senior
Ahmed      senior
Wajdi      junior
Rahma      junior
Salem      junior
Sonia      senior
Mehdi      senior
Name: classe, dtype: object

**2.4 Transformation des données d'apprentissage d'entrée de format brute en format numérique**

Les données d'apprentissage d'entrée ont des types hétérogènes et non numériques. Ainsi, elles sont pas pêtes pour l'apprentissage du modèle de classifieur.

Cette étape consiste à transformer les données d'apprentissage en format nuémrique comme suit :
- Créer une copie de dataframe des données d'entrée d'apprentissage sur laquelle on applique le reste de travail
- Remplir les valeurs manquantes
- Remplacer le salaire et le prime par le revenue (revenue=salaire+prime)
- Remplacer la date de recrutement par l'ancienneté de l'employé
- Remplacer les valeurs discrètes de l'état civil par leurs codes binaires OHE

In [167]:
# Créer une copie des données d'entrée d'apprentissage (X_train) en X_
X_train_=X_train.copy()
X_train_.fillna({'salaire':X_train_['salaire'].mean(),'prime':X_train_['prime'].mean()},inplace=True)
print(X_train)
X_train_['revenue'] = X_train_.salaire + X_train_.prime
print(X_train_)
X_train_.drop(['salaire','prime'],axis=1,inplace=True)

        salaire   prime   etat civil date recrutement
nom
Sameh  2700.330  400.00        marie       19/02/1999
Salma  2500.876  340.60        marie       03/02/2010
Ali    1200.675  100.56  celibataire       20/10/2018
Saleh  1300.876  150.90  celibataire       01/01/2017
        salaire   prime   etat civil date recrutement   revenue
nom
Sameh  2700.330  400.00        marie       19/02/1999  3100.330
Salma  2500.876  340.60        marie       03/02/2010  2841.476
Ali    1200.675  100.56  celibataire       20/10/2018  1301.235
Saleh  1300.876  150.90  celibataire       01/01/2017  1451.776

In [168]:
X_train_

        etat civil date recrutement   revenue
nom
Sameh        marie       19/02/1999  3100.330
Salma        marie       03/02/2010  2841.476
Ali    celibataire       20/10/2018  1301.235
Saleh  celibataire       01/01/2017  1451.776

In [169]:
from datetime import datetime
X_train_['date recrutement'] = pd.to_datetime(X_train_['date recrutement'])

C:\Users\nafkh\AppData\Local\Temp\ipykernel_5736\3025185998.py:2: UserWarning: Parsing '19/02/1999' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  X_train_['date recrutement'] = pd.to_datetime(X_train_['date recrutement'])
C:\Users\nafkh\AppData\Local\Temp\ipykernel_5736\3025185998.py:2: UserWarning: Parsing '20/10/2018' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  X_train_['date recrutement'] = pd.to_datetime(X_train_['date recrutement'])

In [170]:
X_train_['anciennete'] = X_train_['date recrutement'].apply(lambda date : datetime.now().year - date.year)

In [171]:
X_train_.drop(['date recrutement'],axis=1,inplace = True)

In [172]:
X_train_

        etat civil   revenue  anciennete
nom
Sameh        marie  3100.330          23
Salma        marie  2841.476          12
Ali    celibataire  1301.235           4
Saleh  celibataire  1451.776           5

**2.5. Post-traitement des données d'apprentissage**

Normalisation des données d'apprentissage d'entrée 

La normalisation de X_train_ donne lieu à X_train_ss

In [173]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder()
ohe.fit(X_train_[['etat civil']])
ohe.categories_

[array(['celibataire', 'marie'], dtype=object)]

In [174]:
etat_civil_sparse = ohe.transform(X_train_[['etat civil']])
etat_civil = etat_civil_sparse.toarray()
df_etat_civil = df_etat_civil = pd.DataFrame(etat_civil,index = X_train_.index, columns=  ['Etat Civil celib','Etat Civil Marie'])
X_train_ss = pd.concat([X_train_,df_etat_civil],axis=1)
X_train_ss.drop(['etat civil'],axis =1 , inplace= True)
X_train_ss

        revenue  anciennete  Etat Civil celib  Etat Civil Marie
nom
Sameh  3100.330          23               0.0               1.0
Salma  2841.476          12               0.0               1.0
Ali    1301.235           4               1.0               0.0
Saleh  1451.776           5               1.0               0.0

Réduction de dimension des données d'apprentissage d'entrée

La réduction de dimension de X_train_ss donne lieu à X_train_pca

In [175]:
from sklearn.preprocessing import StandardScaler
ss = StandardScaler()
ss.fit(X_train_ss)
X_ss = ss.transform(X_train_ss)
X_ss

array([[ 1.1522359 ,  1.58251314, -1.        ,  1.        ],
       [ 0.83035744,  0.13187609, -1.        ,  1.        ],
       [-1.08489365, -0.92313266,  1.        , -1.        ],
       [-0.89769969, -0.79125657,  1.        , -1.        ]])

In [176]:
from sklearn.decomposition import PCA
pca = PCA(n_components=2)
pca.fit(X_ss)
X_train_pca=pca.transform(X_ss)
X_train_pca

array([[ 2.35389131, -0.53958476],
       [ 1.49982258,  0.67630951],
       [-2.00608662, -0.01996244],
       [-1.84762727, -0.11676231]])

**2.6. Apprentissage avec KNN**

Pour appliquer KNN, importer la classe KNeighborsClassifier du module sklearn.neighbors.

Créer une instance et précisier l'hyperparamètre n_neighbors=2

Appeler la fonction fit() et passer X_train_pca et y_train

In [177]:
from sklearn.neighbors import KNeighborsClassifier
neigh = KNeighborsClassifier(n_neighbors=2)
neigh.fit(X_train_pca,Y_train)

KNeighborsClassifier(n_neighbors=2)

**2.7. Traitement des données de test**

Appliquer le même traitement fait sur les données d'apprentissage d'entrée (transformation en format numérique et  post-traitement)

In [178]:
# Transformation des données de test
# Créer une copie des données d'entrée d'apprentissage (X_train) en X_
X_test_=X_test.copy()
# ...
X_test_.fillna({'salaire':X_test_.salaire.mean(),'prime':X_test_.prime.mean()},inplace=True)
X_test_['revenue']=X_test_.salaire+X_test_.prime
X_test_.drop(['salaire','prime'],axis=1,inplace=True)
X_test_

          etat civil date recrutement      revenue
nom
Ameni    celibataire       11/05/2019  1231.530000
Moufida        marie       09/12/1991  4200.440000
Ahmed          marie       09/09/2004  3365.246600
Wajdi    celibataire       27/11/2015  1465.466600
Rahma    celibataire       04/02/2017  2475.293571
Salem    celibataire       21/11/2017  1665.460000
Sonia          marie       30/11/2005  3201.662000
Mehdi          marie       07/07/2000  3265.246600

Normaliser et réduire la dimension des données de test

In [179]:
X_test_['date recrutement']=pd.to_datetime(X_test_['date recrutement'])
X_test_['anciennete']=X_test_['date recrutement'].apply(lambda date : datetime.now().year - date.year)
X_test_.drop('date recrutement',axis = 1, errors = 'ignore',inplace = True)
X_test_

C:\Users\nafkh\AppData\Local\Temp\ipykernel_5736\2464803886.py:1: UserWarning: Parsing '27/11/2015' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  X_test_['date recrutement']=pd.to_datetime(X_test_['date recrutement'])
C:\Users\nafkh\AppData\Local\Temp\ipykernel_5736\2464803886.py:1: UserWarning: Parsing '21/11/2017' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  X_test_['date recrutement']=pd.to_datetime(X_test_['date recrutement'])
C:\Users\nafkh\AppData\Local\Temp\ipykernel_5736\2464803886.py:1: UserWarning: Parsing '30/11/2005' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  X_test_['date recrutement']=pd.to_datetime(X_test_['date recrutement'])

          etat civil      revenue  anciennete
nom
Ameni    celibataire  1231.530000           3
Moufida        marie  4200.440000          31
Ahmed          marie  3365.246600          18
Wajdi    celibataire  1465.466600           7
Rahma    celibataire  2475.293571           5
Salem    celibataire  1665.460000           5
Sonia          marie  3201.662000          17
Mehdi          marie  3265.246600          22

In [180]:
etat_civil_sparse = ohe.transform(X_test_[['etat civil']])

etat_civil = etat_civil_sparse.toarray()
df_etat_civil = pd.DataFrame(etat_civil,index = X_test_.index, columns=  ['Etat Civil celib','Etat Civil Marie'])
X_test_ss = pd.concat([X_test_,df_etat_civil],axis=1)
X_test_ss.drop(['etat civil'],axis=1,inplace = True)
X_test_ss

             revenue  anciennete  Etat Civil celib  Etat Civil Marie
nom
Ameni    1231.530000           3               1.0               0.0
Moufida  4200.440000          31               0.0               1.0
Ahmed    3365.246600          18               0.0               1.0
Wajdi    1465.466600           7               1.0               0.0
Rahma    2475.293571           5               1.0               0.0
Salem    1665.460000           5               1.0               0.0
Sonia    3201.662000          17               0.0               1.0
Mehdi    3265.246600          22               0.0               1.0

In [181]:
ss.fit(X_test_ss)
X_t_ss = ss.transform(X_test_ss)
X_t_ss

array([[-1.37728598, -1.11613741,  1.        , -1.        ],
       [ 1.59167318,  1.86022901, -1.        ,  1.        ],
       [ 0.75646595,  0.4783446 , -1.        ,  1.        ],
       [-1.1433455 , -0.6909422 ,  1.        , -1.        ],
       [-0.13350181, -0.90353981,  1.        , -1.        ],
       [-0.94334879, -0.90353981,  1.        , -1.        ],
       [ 0.59287865,  0.3720458 , -1.        ,  1.        ],
       [ 0.6564643 ,  0.90353981, -1.        ,  1.        ]])

In [182]:
pca=PCA(n_components=2)
pca.fit(X_t_ss)
X_test_pca=pca.transform(X_t_ss)
X_test_pca

array([[-2.24404636, -0.27446359],
       [ 2.71888509,  0.74614276],
       [ 1.62090492, -0.36026424],
       [-1.91760331,  0.05381857],
       [-1.52358736,  0.48376887],
       [-1.9240768 ,  0.05679233],
       [ 1.48731852, -0.49774793],
       [ 1.7822053 , -0.20804677]])

In [183]:
y_test_predicted=neigh.predict(X_test_pca)
print(Y_test)
print(y_test_predicted)

nom
Ameni      junior
Moufida    senior
Ahmed      senior
Wajdi      junior
Rahma      junior
Salem      junior
Sonia      senior
Mehdi      senior
Name: classe, dtype: object
['junior' 'senior' 'senior' 'junior' 'junior' 'junior' 'senior' 'senior']

C:\Users\nafkh\anaconda3\lib\site-packages\sklearn\neighbors\_classification.py:228: FutureWarning: Unlike other reduction functions (e.g. `skew`, `kurtosis`), the default behavior of `mode` typically preserves the axis it acts along. In SciPy 1.11.0, this behavior will change: the default value of `keepdims` will become False, the `axis` over which the statistic is taken will be eliminated, and the value None will no longer be accepted. Set `keepdims` to True or False to avoid this warning.
  mode, _ = stats.mode(_y[neigh_ind, k], axis=1)

**2.8. Evaluation de classifieur avec les données de test**

Prédiction des données de test

In [184]:
Y_test

nom
Ameni      junior
Moufida    senior
Ahmed      senior
Wajdi      junior
Rahma      junior
Salem      junior
Sonia      senior
Mehdi      senior
Name: classe, dtype: object

In [185]:
y_test_predicted

array(['junior', 'senior', 'senior', 'junior', 'junior', 'junior',
       'senior', 'senior'], dtype=object)

Score d'accuracy

In [186]:
Y_test == y_test_predicted

nom
Ameni      True
Moufida    True
Ahmed      True
Wajdi      True
Rahma      True
Salem      True
Sonia      True
Mehdi      True
Name: classe, dtype: bool

Matrice de confusion

In [187]:
#

Rappel et pércision

In [ ]:
#

**2.9. Visualisation des données**

In [ ]:
classe_junior=#
classe_senior=#

In [ ]:
#